app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @subreddit = Subreddit.find(params[:subreddit_id])
    @article.subreddit_id = @subreddit.id

    respond_to do |format|
      if @article.save
---
SELECT  "subreddits".* FROM "subreddits" WHERE "subreddits"."id" = ? LIMIT 1  [["id", 0]]
INSERT INTO "articles" ("title", "body", "url", "subreddit_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)