app/controllers/subreddits_controller.rb

SELECT "subreddits".* FROM "subreddits"
---
  def index
    @subreddits = Subreddit.all

SELECT  "subreddits".* FROM "subreddits" WHERE "subreddits"."slug" = ? LIMIT 1  [["slug", "3"]]
---
  def show
    @subreddit = Subreddit.find_by(slug: params[:slug])

INSERT INTO "subreddits" ("title", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "my subreddit"], ["slug", "mysubreddit"], ["created_at", "2016-02-12 19:49:08.198229"], ["updated_at", "2016-02-12 19:49:08.198229"]]
---
  def create
    @subreddit = Subreddit.new(subreddit_params)
    respond_to do |format|
      if @subreddit.save

SELECT  "subreddits".* FROM "subreddits" WHERE "subreddits"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_subreddit
      @subreddit = Subreddit.find(params[:id])